# SomeDimensionsLostOnPaste Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..SomeDimensionsLostOnPaste Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Some Dimensions were not copied because some References were lost.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SomeDimensionsLostOnPaste { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SomeDimensionsLostOnPaste As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SomeDimensionsLostOnPaste {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace